In [1]:
import pandas as pd

In [2]:
pd.__version__

'2.2.2'

In [3]:
data = pd.read_csv('dataset.csv')

In [4]:
data

    fname     lname   age   gender
0  davood    rajaee    23     male
1    sara   hashemi    18   female

In [5]:
animals = ['Tiger', 'Bear', 'Lion']
pdAnimals = pd.Series(animals)
pdAnimals

0    Tiger
1     Bear
2     Lion
dtype: object

In [6]:
type(pdAnimals)

pandas.core.series.Series

In [7]:
pdAnimals[1]

'Bear'

In [8]:
 animals = {
     'n1' : 'Tiger',
     'n2' : 'Bear',
     'n3' : 'Lion'
 }
pAnimals = pd.Series(animals)
pAnimals

n1    Tiger
n2     Bear
n3     Lion
dtype: object

In [9]:
pAnimals.index

Index(['n1', 'n2', 'n3'], dtype='object')

In [10]:
pAnimals.values

array(['Tiger', 'Bear', 'Lion'], dtype=object)

In [11]:
pAnimals['n1']

'Tiger'

In [12]:
pAnimals.loc['n1']

'Tiger'

In [13]:
pAnimals.iloc[0]

'Tiger'

In [14]:
for item in pAnimals:
    print('salam ' + str(item))

salam Tiger
salam Bear
salam Lion

In [15]:
import numpy as np

In [16]:
num = [2 , 20, 5]
pNum = pd.Series(num)
np.sum(pNum)

27

In [17]:
for index, item in pdAnimals.items():
    print('Salam ' + str(item) + '... index is ' + str(index))

Salam Tiger... index is 0
Salam Bear... index is 1
Salam Lion... index is 2

In [18]:
ani1 = {
    'a1' : 'tiger1',
    'a2' : 'lion1',
    'a3' : 'cat1'
}
ps1 = pd.Series(ani1)
ani2 = {
    'a1' : 'tiger2',
    'a2' : 'lion2',
    'a3' : 'cat2'
}
ps2 = pd.Series(ani2)
ani3 = {
    'a1' : 'tiger3',
    'a2' : 'lion2',
    'a3' : 'cat3'
}
ps3 = pd.Series(ani3)

df = pd.DataFrame([ps1, ps2, ps3])
df

       a1     a2    a3
0  tiger1  lion1  cat1
1  tiger2  lion2  cat2
2  tiger3  lion2  cat3

In [19]:
df.loc[0].loc['a2']

'lion1'

In [20]:
ani1 = {
    'a1' : 'tiger1',
    'a2' : 'lion1',
    'a3' : 'cat1'
}
ps1 = pd.Series(ani1)
ani2 = {
    'a1' : 'tiger2',
    'a2' : 'lion2',
    'a3' : 'cat2'
}
ps2 = pd.Series(ani2)
ani3 = {
    'a1' : 'tiger3',
    'a2' : 'lion2',
    'a3' : 'cat3'
}
ps3 = pd.Series(ani3)

df = pd.DataFrame([ps1, ps2, ps3], index=['n1', 'n2', 'n3'])
df

        a1     a2    a3
n1  tiger1  lion1  cat1
n2  tiger2  lion2  cat2
n3  tiger3  lion2  cat3

In [21]:
df.loc['n1'].loc['a2']

'lion1'

In [22]:
df.loc['n1', 'a2']

'lion1'

In [23]:
df.loc[['n1', 'n2']]

        a1     a2    a3
n1  tiger1  lion1  cat1
n2  tiger2  lion2  cat2

In [24]:
df.loc[['n1', 'n2'], 'a2']

n1    lion1
n2    lion2
Name: a2, dtype: object

In [25]:
df.loc[:, ['a1', 'a2']]

        a1     a2
n1  tiger1  lion1
n2  tiger2  lion2
n3  tiger3  lion2

In [26]:
df2 = df.drop('n2')
df2

        a1     a2    a3
n1  tiger1  lion1  cat1
n3  tiger3  lion2  cat3

In [27]:
df

        a1     a2    a3
n1  tiger1  lion1  cat1
n2  tiger2  lion2  cat2
n3  tiger3  lion2  cat3

In [28]:
df.drop('n2', inplace=True)

In [29]:
df

        a1     a2    a3
n1  tiger1  lion1  cat1
n3  tiger3  lion2  cat3

In [30]:
  df2 = df

In [31]:
df

        a1     a2    a3
n1  tiger1  lion1  cat1
n3  tiger3  lion2  cat3

In [32]:
df2

        a1     a2    a3
n1  tiger1  lion1  cat1
n3  tiger3  lion2  cat3

In [33]:
df3 = df[['a1', 'a2']]

In [34]:
df3

        a1     a2
n1  tiger1  lion1
n3  tiger3  lion2

In [35]:
df3.drop('n1', inplace=True)

/tmp/ipykernel_4939/2006645550.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df3.drop('n1', inplace=True)

In [36]:
df3

        a1     a2
n3  tiger3  lion2

In [37]:
df

        a1     a2    a3
n1  tiger1  lion1  cat1
n3  tiger3  lion2  cat3

In [38]:
df3

        a1     a2
n3  tiger3  lion2

In [39]:
df

        a1     a2    a3
n1  tiger1  lion1  cat1
n3  tiger3  lion2  cat3

In [40]:
n2 = df['a2']

In [41]:
n2

n1    lion1
n3    lion2
Name: a2, dtype: object

In [42]:
n2 += '!'

In [43]:
n2

n1    lion1!
n3    lion2!
Name: a2, dtype: object

In [44]:
df

        a1      a2    a3
n1  tiger1  lion1!  cat1
n3  tiger3  lion2!  cat3

In [45]:
df.head()

        a1      a2    a3
n1  tiger1  lion1!  cat1
n3  tiger3  lion2!  cat3

In [46]:
df['a4'] = df['a1'] + ' - ' + df['a3']
df.head()

        a1      a2    a3             a4
n1  tiger1  lion1!  cat1  tiger1 - cat1
n3  tiger3  lion2!  cat3  tiger3 - cat3

In [47]:
df = pd.read_csv('Dataset.csv')

In [48]:
df

,Suburb,Address,Rooms,Type,Price,Method,SellerG,Date,Postcode,Regionname,Propertycount,Distance,CouncilArea
0,Abbotsford,49 Lithgow St,3,h,1490000.0,S,Jellis,1/04/2017,3067,Northern Metropolitan,4019,3.0,Yarra City Council
1,Abbotsford,59A Turner St,3,h,1220000.0,S,Marshall,1/04/2017,3067,Northern Metropolitan,4019,3.0,Yarra City Council
2,Abbotsford,119B Yarra St,3,h,1420000.0,S,Nelson,1/04/2017,3067,Northern Metropolitan,4019,3.0,Yarra City Council
3,Aberfeldie,68 Vida St,3,h,1515000.0,S,Barry,1/04/2017,3040,Western Metropolitan,1543,7.5,Moonee Valley City Council
4,Airport West,92 Clydesdale Rd,2,h,670000.0,S,Nelson,1/04/2017,3042,Western Metropolitan,3464,10.4,Moonee Valley City Council
...,...,...,...,...,...,...,...,...,...,...,...,...,...
63018,Roxburgh Park,3 Carr Pl,3,h,566000.0,S,Raine,31/03/2018,3064,Northern Metropolitan,5833,20.6,Hume City Council
63019,Roxburgh Park,9 Parker Ct,3,h,500000.0,S,Raine,31/03/2018,3064,Northern Metropolitan,5833,20.6,Hume City Council
63020,Roxburgh Park,5 Parkinson Wy,3,h,545000.0,S,Raine,31/03/2018,3064,Northern Metropolitan,5833,20.6,Hume City Council
63021,Thomastown,3/1 Travers St,3,u,NaN,PI,Barry,31/03/2018,3074,Northern Metropolitan,7955,15.3,Whittlesea City Council
63022,Williams Landing,1 Diadem Wy,4,h,NaN,SP,Aussie,31/03/2018,3027,Western Metropolitan,1999,17.6,Wyndham City Council

In [ ]:
df['Type'].unique()